Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཆོས་གང་ལས་འདའ་བར་བྱ་བ་འམ། གང་ལ་གནས་པར་བྱ་བའི་ཆོས་དེ་ལྟ་བུ་མེད་དོ།
en: If you ask why, it is because there is no thing that the perfection of wisdom should go beyond or in which it should dwell.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་སྟེ།
en: If you ask why, Kauśika, it is because all phenomena are empty of inherent existence.

source: རང་བཞིན་གྱིས་སྟོང་པའི་ཆོས་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: Anything that is empty of inherent existence is a nonentity.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ལ་ནི་བླང་བར་བྱ་བ་འམ། དོར་བར་བྱ་བ་འམ། བསྐྱེད་པར་བྱ་བ་འམ། དགག་པར་བྱ་བའི་ཆོས་གང་ཡང་མེད་དོ་ཞེས་སྟོན་ཏེ།
en: Whatever is the perfection of wisdom is nothing at all that is to be adopted or rejected, or to be generated or stopped.

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་སྟོན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་མི་སྟོན་ཏོ།
en: Kauśika, those noble sons or noble daughters who teach in that manner do not teach an imitation of the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་དེ་བས་ན་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་དོན་བསྟན་པར་བྱ་སྟེ།
en: Kauśika, so it is that the noble sons or noble daughters should reveal the meaning of the perfection of wisdom in that manner.

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་སྟོན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་ཆེས་མང་དུ་འཕེལ་གྱི། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་སྔ་མ་དག་གི་ནི་མ་ཡིན་ནོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །
en: Kauśika, the mass of merit of those noble sons or noble daughters who teach in that manner will increase more than that of the aforementioned noble sons or noble daughters. “

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ། གསོལ་པ།
en: Moreover, Kauśika, if any noble sons or noble daughters were to establish the beings of Jambudvīpa, as many as there are, in the fruit of entering the stream to nirvāṇa, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase many times on that basis?” “

source: བདེ་བར་གཤེགས་པ་མང་ངོ་།
en: It would, Sugata!” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་གཞན་ལ་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་པ་དང་། འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟུང་ཤིག །
en: Kauśika,” continued the Blessed One, “compared to them, if any noble sons or noble daughters who extensively describe, reveal, explain, interpret, and elucidate this perfection of wisdom to others, in accordance with its meaning and letters, presenting it in an authentic manner, should exhort them, saying, ‘Come here, noble child!

source: ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཆོངས་ཤིག །
en: You should take up, uphold, recite, master, and focus their attention correctly on the profound perfection of wisdom!

source: ལྷོགས་ཤིག །ཚུལ་བཞིན་དུ་ཡིད་ལ་གྱིས་ཤིག །ཇི་ལྟར་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནན་ཏན་དུ་གྱིས་ཤིག་ཅེས་བསྒོ་ན།
en: You should earnestly apply yourself to the perfection of wisdom as it has been taught!’

source: ཆེས་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ལོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: then the merit of those would increase manifold to a greater extent.

source: ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས། རྒྱུན་ཏུ་ཞུགས་པ་རྣམས་ཡོད་པར་འགྱུར་རོ།
en: If you ask why, Kauśika, those who enter the stream to nirvāṇa are discerned through this perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ལྟ་ཡང་ཞོག །གླིང་ཆེན་པོ་བཞིའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཀོད་པ་ལྟ་ཡང་ཞོག་གི།
en: Kauśika, leaving aside the establishing of the beings of Jambudvīpa in the fruit of entering the stream to nirvāṇa, leaving aside the establishing in it of the beings of the world system of the four continents, and leaving aside the beings of the confined chiliocosm, leaving aside the beings of the medium dichiliocosm, and leaving aside the beings of the great trichiliocosm—Kauśika, if any noble sons or noble daughters {Ki.

source: ཀཽ་ཤི་ཀ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ཞིང་། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ། གསོལ་པ།
en: II-III: 116} were to establish those beings of the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, in the fruit of entering the stream to nirvāṇa, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase many times on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་གཞན་ལ་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་ཡང་དག་པར་བསྟན་པ་བྱས་པ་དང་། འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟུང་ཤིག །
en: Compared to them, Kauśika,” continued the Blessed One, “if any noble sons or noble daughters who extensively describe, reveal, explain, interpret, and elucidate this perfection of wisdom to others, in accordance with its meaning and letters, presenting it in an authentic manner, should exhort them, saying, ‘Come here, noble child!

source: ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་རྒྱུན་ཏུ་ཞུགས་པ་རྣམས་ཡོད་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ་བཀོད།
en: If you ask why, Kauśika, those who enter the stream to nirvāṇa are discerned through this perfection of wisdom. “

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Moreover, Kauśika, if any noble sons or noble daughters were to establish the beings of Jambudvīpa, as many as there are, in the fruit of being destined for only one more rebirth, or to establish them in the fruit of no longer being subject to rebirth, in arhatship, or individual enlightenment, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase many times on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་གཞན་ལ་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤང་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་པ་དང་། འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟུང་ཤིག །
en: Compared to them, Kauśika,” continued the Blessed One, “if any noble sons or noble daughters who extensively describe, reveal, explain, interpret, and elucidate this perfection of wisdom to others, in accordance with its meaning and letters, presenting it in an authentic manner, should exhort them, saying, ‘Come here, noble child!

source: ཆེས་བསོད་ནམས་མང་དུ་འཕེལ་ལོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: then their merit would increase manifold to a greater extent.

source: ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་སངས་རྒྱས་རྣམས་ཡོད་པར་འགྱུར་རོ།
en: If you ask why, Kauśika, those who are destined for only one more rebirth, those who will no longer be reborn, those who are arhats, and the pratyekabuddhas are discerned through this perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་བཀོད་པ་ལྟ་ཡང་ཞོག །གླིང་ཆེན་པོ་བཞིའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་།
en: Kauśika, leaving aside the establishing of the beings of the world system of the four continents in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, in arhatship, or individual enlightenment, and [likewise] leaving aside the beings of the confined chiliocosm, leaving aside the beings of the medium dichiliocosm, and leaving aside the beings of the great trichiliocosm, {Ki.

source: རང་བྱང་ཆུབ་ལ་བཀོད་པ་ལྟ་ཡང་ཞོག་གི། ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: II-III: 117} if any noble sons or noble daughters were to establish those beings of the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, in arhatship, or individual enlightenment, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase many times on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་གཞན་ལ་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་པ་དང་།
en: Compared to them, Kauśika,” continued the Blessed One, “if any noble sons or noble daughters who extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to others, in accordance with its meaning and letters, presenting it in an authentic manner, should exhort them, saying, ‘Come here, noble child!

source: འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟུང་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཆོངས་ཤིག །
en: You should take up, uphold, recite, master, and focus your attention correctly on the profound perfection of wisdom!

source: ཆེས་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ལོ།
en: then their merit would increase manifold to a greater extent.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་།
en: If you ask why, Kauśika, those who are destined for only one more rebirth, those who will no longer be reborn, those who are arhats, and pratyekabuddhas are discerned through this perfection of wisdom. “

source: རང་སངས་རྒྱས་རྣམས་ཡོད་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་བ་བྱས་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Moreover, Kauśika, if any noble sons or noble daughters were to encourage the beings of Jambudvīpa, as many as there are, toward unsurpassed, complete enlightenment, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase many times on that basis?” {

source: འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟུང་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །ཚུལ་བཞིན་དུ་ཡིད་ལ་གྱིས་ཤིག །
en: You should take up, uphold, recite, master, and focus your attention correctly on the profound perfection of wisdom!

source: ཇི་ལྟར་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནན་ཏན་དུ་གྱིས་ཤིག །
en: You should earnestly apply yourself to the perfection of wisdom as it has been taught!

source: རིགས་ཀྱི་བུ་ཁྱོད་གང་གི་ཚེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཇི་ལྟར་བསྟན་པ་ལ་ནན་ཏན་བྱེད་པ་དེའི་ཚེ། རིགས་ཀྱི་བུ་ཁྱོད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པར་འགྱུར་རོ།
en: Noble child, when you earnestly apply yourself to the perfection of wisdom as it has been revealed, at that time, noble child, you will train in the perfection of wisdom.

source: །རིགས་ཀྱི་བུ་ཁྱོད་གང་གི་ཚེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པར་གྱུར་པ་དེའི་ཚེ། ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་རྣམས་ཐོབ་པར་འགྱུར་རོ།
en: Noble child, when you train in the perfection of wisdom, at that time you will attain the attributes of all-aspect omniscience.

source: །གང་གི་ཚེ་ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་རྣམས་ཐོབ་པར་གྱུར་པ་དེའི་ཚེ། ཁྱོད་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་དེ་བས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: When you attain the attributes of all-aspect omniscience, at that time you will, along with that, complete the cultivation of the perfection of wisdom.

source: །གང་གི་ཚེ་ཁྱོད་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་དེ་དག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་དེའི་ཚེ། ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ་ཞེས་བསྒོ་ན།
en: When, along with that, you complete the cultivation of the perfection of wisdom, at that time you will attain consummate buddhahood in unsurpassed, complete enlightenment!’

source: ཀཽ་ཤི་ཀ་འདི་ལས་བྱུང་བ་ནི་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སོ། །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་བ་བྱས་པ་ལྟ་ཡང་ཞོག །གླིང་ཆེན་པོ་བཞིའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་བ་བྱས་པ་ལྟ་ཡང་ཞོག་གི། །ཀཽ་ཤི་ཀ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ཞིང་།
en: If you ask why, Kauśika, bodhisattva great beings who have initially set their minds on enlightenment originate from this perfection of wisdom. “

source: གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་བ་བྱས་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Kauśika, leaving aside their encouraging of the beings of Jambudvīpa toward unsurpassed, complete enlightenment, leaving aside their encouraging of the beings of the world system of the four continents toward unsurpassed, complete enlightenment, and likewise leaving aside the beings of the confined chiliocosm, leaving aside the beings of the medium dichiliocosm, and leaving aside the beings of the great trichiliocosm, as many as there are—Kauśika, if any noble sons or noble daughters were to encourage all those beings of the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, toward unsurpassed, complete enlightenment, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase many times on that basis?” “

source: །བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ།
en: It would, Sugata!” “

source: ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་གཞན་ལ་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་པ་དང་། འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཟུང་ཤིག །
en: Compared to them, Kauśika,” continued the Blessed One, “if any noble sons or noble daughters who extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to others, in accordance with its meaning and letters, presenting it in an authentic manner, should exhort them, saying, ‘Come here, noble child!

source: ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །ཚུལ་བཞིན་དུ་ཡིད་ལ་གྱིས་ཤིག །ཇི་ལྟར་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནན་ཏན་དུ་གྱིས་ཤིག།
en: You should take up, uphold, recite, master, and focus your attention correctly on the profound perfection of wisdom!

source: རིགས་ཀྱི་བུ་ཁྱོད་གང་གི་ཚེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཇི་ལྟར་བསྟན་པ་ལ་ནན་ཏན་བྱེད་པ་དེའི་ཚེ།
en: You should earnestly apply yourself to the perfection of wisdom as it has been taught!

source: རིགས་ཀྱི་བུ་ཁྱོད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པར་འགྱུར་རོ།
en: Noble child, when you earnestly apply yourself to the perfection of wisdom as it has been revealed, at that time, noble child, you will train in the perfection of wisdom. {Ki.

source: །གང་གི་ཚེ་ཁྱོད་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་དེ་བས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་དེའི་ཚེ། ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ་ཞེས་བསྒོ་ན།
en: When, along with that, you complete the cultivation of the perfection of wisdom, at that time you will attain consummate buddhahood in unsurpassed, complete enlightenment!’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་འདི་ལས་བྱུང་བ་ནི་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སོ།
en: If you ask why, Kauśika, bodhisattva great beings who have initially set their minds on enlightenment originate from this [perfection of wisdom]. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ། གསོལ་བ།
en: Moreover, Kauśika, if any noble sons or noble daughters were to establish the beings of Jambudvīpa, as many as there are, on the level at which progress has become irreversible, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase many times on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་གཞན་ལ་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་པ་དང་།
en: Compared to them, Kauśika,” continued the Blessed One, “if any noble sons or noble daughters who extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to others, in accordance with its meaning and letters, presenting it in an authentic manner, should exhort them, saying, ‘Come here, noble child!

source: འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟུང་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག ། ཚུལ་བཞིན་དུ་ཡིད་ལ་གྱིས་ཤིག །
en: You should take up, uphold, recite, master, and focus your attention correctly on the profound perfection of wisdom!

source: རིགས་ཀྱི་བུ་ཁྱོད་གང་གི་ཚེ། ཇི་ལྟར་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནན་ཏན་དུ་བྱེད་པ་དེའི་ཚེ། རིགས་ཀྱི་བུ་ཁྱོད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པར་འགྱུར་རོ།
en: Noble child, when you earnestly apply yourself to the perfection of wisdom as it has been revealed, at that time, noble child, you will train in the perfection of wisdom.

source: །རིགས་ཀྱི་བུ་ཁྱོད་གང་གི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པར་གྱུར་པ་དེའི་ཚེ་ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་རྣམས་ཐོབ་པར་འགྱུར་རོ།
en: Noble child, when you train in the perfection of wisdom, at that time you will attain the attributes of all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་འདི་ལས་བྱུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕྱིར་མི་ལྡོག་པའི་སའོ། །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་རྣམས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བཀོད་པ་ལྟ་ཡང་ཞོག །གླིང་ཆེན་པོ་བཞིའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །
en: If you ask why, Kauśika, the level at which progress has become irreversible, of which bodhisattva great beings partake, originates from this [perfection of wisdom]. “

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བཀོད་པ་ལྟ་ཡང་ཞོག་གི། ཀཽ་ཤི་ཀ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Kauśika, leaving aside their establishing of the beings of Jambudvīpa on the level at which progress has become irreversible, leaving aside their establishing of the beings of the world system of the four continents on the level at which progress has become irreversible, and likewise leaving aside the beings of the confined chiliocosm, leaving aside the beings of the medium dichiliocosm, and leaving aside the beings of the great trichiliocosm, as many as there are—Kauśika, if any noble sons or noble daughters were to establish all those beings of the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, on the level at which progress has become irreversible, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase many times on that basis?” “

source: རིགས་ཀྱི་བུ་ཁྱོད་གང་གི་ཚེ་ཇི་ལྟར་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནན་ཏན་དུ་བྱེད་པ་དེའི་ཚེ། རིགས་ཀྱི་བུ་ཁྱོད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པར་འགྱུར་རོ།
en: Noble child, when you earnestly apply yourself to the perfection of wisdom as it has been revealed, at that time, noble child, you will train in the perfection of wisdom.

source: །གང་གི་ཚེ་ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་རྣམས་ཐོབ་པར་གྱུར་པ་དེའི་ཚེ། ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ་ཞེས་བསྒོ་ན།
en: When you attain the attributes of all-aspect omniscience, at that time you will attain consummate buddhahood in unsurpassed, complete enlightenment!’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཕྱིར་མི་ལྡོག་པའི་སའོ།
en: If you ask why, Kauśika, the level at which progress has become irreversible of bodhisattva great beings originates from the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏེ། དེ་དག་ལ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་རྒྱ་ཆེར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་པ་དང་།
en: Moreover, Kauśika, if any noble sons or noble daughters who extensively describe, reveal, explain, interpret, analyze, and elucidate this perfection of wisdom to others, in accordance with its meaning and letters, presenting it in an authentic manner, having induced those beings of Jambudvīpa, as many as there are, toward unsurpassed, complete enlightenment, were to exhort them, saying, ‘Come here, noble child!

source: འདི་སྐད་དུ་ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟུང་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག། ཚུལ་བཞིན་དུ་ཡིད་ལ་གྱིས་ཤིག །
en: You should take up, uphold, recite, master, and focus your attention correctly on the profound perfection of wisdom!

source: ཆེས་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ལོ། །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་ལྟ་ཡང་ཞོག །གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོའི་སེམས་ཅན་ལྟ་ཡང་ཞོག །
en: then their merit would increase to an extent many times greater. “
